import googletrans

translator = googletrans.Translator()

def translate_marathi_english(text: str, dest='en') -> str:
    if not text:  # Handle empty text case
        return ""

    # Ensure UTF-8 encoding
    text = text.encode('utf-8').decode('utf-8')
    chunk_size = 500
    num_chunks = (len(text) + chunk_size - 1) // chunk_size
    translations = []
    # Translate each chunk and append the translations
    for i in range(num_chunks):
        chunk = text[i * chunk_size: (i + 1) * chunk_size]
        translation = translator.translate(chunk, dest=dest).text
        translations.append(translation)

    english_text = "".join(translations)

    # print("english_text : "+ english_text)
    return english_text


marathi_text = "महाराष्ट्र शासनचसख  निरमिवाषस्णयतेलोफठेता -महाराष्ट्र लोकसेवा आयोगगोल्ड फिल्ड, प्लॉट नंबर ३४, सरोवरसमोर, सेक्टर ११, सीबीडी बेलापूर, नवी मुंबई-४००६१४०२२-६९३८५९००७ंँ मटतऐ2टए डटऐ2@७2डट०४^2डए=७ऐड://@2डट 8^७ऐट2ड//@2ड^ँू ौ^@ब2डटऔःटू@औट2ू2डटक्रमांकःडीआरए ०९२१ प्र.क्र. ४२ २०२३ जाहिरातदिनांकः ०६ फेब्रुवारी , २०२४शुध्दीपत्रकविषयसहयोगी प्राध्यापकसहायकप्राध्यापक ग्रंथपाल शारिरीक शिक्षण संचालक , महाराष्ट्र शिक्षणसेवा , गट-अ ( महाविद्यालयीन शाखा )संदर्भजाहिरात क्रमांक- ११३२०२३ व ११४/२०२३शासनाच्या उच्च व तंत्र शिक्षण विभागाच्या प्राप्तमागणीपत्रानुसार उच्च शिक्षण संचालनालयांतर्गत शासकीय महाविद्यालयसंस्थेमधीलसहयोगी प्राध्यापकसहायक प्राध्यापक ग्रंथपाल शारिरीक शिक्षण संचालक, महाराष्ट्र शिक्षण सेवा, गटअ (महाविद्यालयीन शाखा) या संवर्गाच्याजाहिराती ( अनुकमे ११३ २०२३ व ११४/२०२३) आयोगामार्फत दिनांक १८ ऑक्टोबर, २०२३ रोजी प्रसिध्द करण्यात आलेल्या आहेत़.२जाहिरातीस अनुसरुन अर्ज स्वीकृतीच्या अंतिम दिनांकानंतर, शासन पत्र, उच्च व तंत्र शिक्षण विभाग , क्रमांक संकीर्ण २०२२ प्र.क्र. १९५ मशि-१, दिनांक १८ जानेवारी, २०२४ अन्वये सहयोगी प्राध्यापक, गट-अ (जा.क्र.११३ २०२३) आणि सहायक प्राध्यापक ग्रथपाल शारिरीक शिक्षणसंचालक (जा.क्र.११४ २०२३), महाराष्ट्र शिक्षणगट-अ या संवर्गाच्या आयोगामार्फत प्रसिध्द करण्यात आलेल्या जाहिरातींच्याअनुषंगानेशासन निर्णय उच्च व तंत्र शिक्षण विभाग, क्रमांक संकीर्ण २०२२ प्र.क्र.१९५ मशि-१ दिनांक ०८ मार्च २०१९ मधील ४४ येथे नमूद तरतुदीनुसारअनुसूचित जाती, अनुसूचित जमाती, दिव्यांग उमेदवार व राज्याच्या यादीतील इतर मागास प्रवर्गात समाविष्ट असणाऱ्या जाती तसेच महाराष्ट्र राज्यातीलज्याजातींचा केंद्र शासनाच्या इतर मागास प्रवर्गाच्या यादीमध्ये समावेश आहे, त्या जातीतील उमेदवारांना पदव्युत्तर पदवीकरीता आवश्यक असलेल्या ५५टक्क गुणांमध्ये५टक्के सवलत लागू आहे, असे अभिप्राय प्राप्त झालेले आहेत़.३शासनाच्या उपरोक्त अभिप्रायास अनुसरुन, सहयोगी प्राध्यापक, गटअ आणि सहायक प्राध्यापक ग्रथपाल शारिरीक शिक्षण संचालकमहाराष्ट्र शिक्षण सेवा, गट-अ (अनुक्रमे जा.क्र.११३ २०२३आणि  जा.क्र.११४ २०२३) या संवर्गाच्या जाहिरातींकरीता अर्हताप्राप्त ठरणाऱ्याउमेदवारांना अर्ज सादर करण्याची संधी उपलब्ध करुन देण्यात येत असून जाहिरातीस अनुसरुन अर्ज सादर करण्याच्या प्रक्रियेस खालीलप्रमाणे मुदतवाढदेण्यात येत आहेःअ.क्रतपशीलविहित कालावधीअज सादर करावयाचाकालावधीदिनांक ०७ फेब्रुवारी, २०२४ रोजी १४.०० तेदिनांक १४ फेब्रुवारी, २०२४ रोजी २३.५९ऑनलाईन पध्दतीने परीक्षा शुल्क भरण्याकरीता विहित अंतिम दिनांकदिनांक १४ फेब्रुवारी, २०२४ रोजी २३.५९३भारतीय स्टेट बँकेमध्ये चलनाद्वारे परीक्षा शुल्क भरावयाचेझाल्यासदिनांक १६ फेब्रुवारी, २०२४ रोजी २३.५९चलनाची प्रत घेणे याकरीता विहित अंतिम दिनांक४चलनाद्वारे परीक्षाशुल्क   भरावयाचेझाल्यास भारतीय स्टेट बँकेमध्येदिनांक १७ फेब्रुवारी, २०२४ रोजी २३.५९शुल्क भरण्याचा अंतिम दिनांक४.वयोमर्यादा गणण्याचा दिनांक तसेच शैक्षणिक अर्हता आणि अनुभवाचा कालावधी हा संबंधित मूळ जाहिरातीमध्ये नमूद दिनांकानुसारच गणण्यातयेईल.५शासन निर्णय, सामान्य प्रशासन विभाग, क्रमांक सनिव २०२३ प्र.क्र.१४ कार्या-१२, दिनांक ०३ मार्च, २०२३ अनुसार कमाल वयोमर्यादेत दोन वर्षेइतकी शिथिलता देण्यात येत आहे.६विषयांकित जाहिरातींमधील इतर अटी व तरतुदींमध्ये कोणताही बदल नाही.७सदरशुध्दीपत्रक तसेच मूळ जाहिरात क्रमांक ११३ २०२३ व ११४/२०२३ आयोगाच्या 1ऐ  // ७,आ[ 8ौ  तसेच ऐऐठ  ७टब1९ षद  यासंकेतस्थळावर उपलब्ध आहे.उप सचिव, जाहिरातठिकाण : नवी मुंबई.महाराष्ट्र लोकसेवा आयोगआयोगाच्या कार्यालयात, परीक्षा कक्षात, परीक्षा केंद्राच्या परिसरात, तसेच, शारीरिक चाचणी व मुलाखतीच्या वेळी मोबाईल फोन, अथवा इतरकोणत्याही प्रकारची इलेक्ट्रॉनिक साधने आणण्यास व वापरण्यास सक्त मनाई आहे.प्रमाणपत्र तपासणीच्या वेळी पात्रतेसंदर्भातील सर्व मूळ प्रमाणपत्रे सादर न केल्यास शिफारस नियुक्तीसाठी विचार करण्यात येणार नाही.फ:ृग मध7 1075-2024.त0ट49त्रिशूलविहारसेवा"
print("marathi text : "+marathi_text)
english = translate_marathi_english(marathi_text , 'en')
print("english_text : "+english)